Repository: cfangmeier/tuijam
Catalog: lang/*/LC_MESSAGES/tuijam.po
Languages: ru_ru

# search_results_title
source: Search Results
ru_ru: Результаты Поиска

# queue_title
source: Queue
ru_ru: Очередь

# no_google_creds_found0
source: No local credentials file found.
ru_ru: Файл локальных учётных данных не найден.

# no_google_creds_found1
source: TUIJam will now open a browser window so you can provide permission
ru_ru: TUIJam сейчас откроет окно браузера, чтобы Вы могли дать

# no_google_creds_found2
source: for TUIJam to access your Google Play Music account.
ru_ru: разрешение TUIJam на доступ к Вашему аккаунту Google Play Music.

source: Press Enter to continue.
ru_ru: Нажмите Enter, чтобы продолжить.

# oauth_failed
source: OAuth authentication failed.
ru_ru: Авторизация OAuth не удалась.

# lastfm_key_retrieval_failure
source: Could not retrieve Last.fm keys.
ru_ru: Не могу получить ключи Last.fm.

# scrobbling_not_available
source: Scrobbling will not be available.
ru_ru: Скробблинг будет недоступен.

# yt_key_retrieval_failure
source: Could not retrieve YouTube key.
ru_ru: Не могу получить ключ YouTube.

# yt_not_available
source: YouTube will not be available.
ru_ru: YouTube будет недоступен.

# playlist_liked_title
source: Liked
ru_ru: Понравилось Вам

source: Saving queue
ru_ru: Cохраняю очередь.

# queue_restore_fail
source: Failed to restore queue. :(
ru_ru: Не удалось восстановить очередь. :(

# history_restore_fail
source: Failed to restore recently played. :(
ru_ru: Не удалось восстановить историю прослушиваний. :(

# tuijam_app_desc
source: A fancy TUI client for Google Play Music.
ru_ru: Навороченный терминальный клиент для Google Play Music.

source: Starting up.
ru_ru: Запускаюсь.

source: Logging in.
ru_ru: Авторизуюсь.

# enabling_ext_control
source: Enabling external control.
ru_ru: Включаю внешний контроль.

# fail
source: Failed.
ru_ru: Не удалось.

source: Restoring queue.
ru_ru: Восстанавливаю очередь.

source: Restoring history.
ru_ru: Восстанавливаю историю.

# exception_thrown
source: Something bad happened! :( See log file ($HOME/.config/tuijam/log.txt) for more information.
ru_ru: Произошло что-то плохое! :( Смотрите лог ($HOME/.config/tuijam/log.txt), чтобы узнать больше.

# lastfm_err_first_run0
source: It seems that you haven't run tuijam yet.
ru_ru: Похоже, что Вы ещё не запускали TUIJam.

# lastfm_err_first_run1
source: Please run it first, then authorize to Last.fm.
ru_ru: Пожалуйста, запустите сначала его, затем авторизуйтесь в Last.fm.

# lastfm_generating_token
source: Generating Last.fm authentication token.
ru_ru: Генерирую токен аутентификации Last.fm.

# lastfm_open_auth_link_prompt
source: Please open this link in your browser and authorize the app in case the window hasn't been opened automatically:
ru_ru: Пожалуйста, откройте эту ссылку в Вашем браузере и авторизуйте приложение, если окно не открылось автоматически:

# lastfm_press_enter_to_get_sk
source: After that, press Enter to get your session key...
ru_ru: После этого нажмите Enter, чтобы получить ключ сессии...

# lastfm_auth_fail
source: Failed to get a session key. Have you authorized?
ru_ru: Не удалось получить ключ сессии. Вы авторизовались?

# lastfm_auth_success
source: Successfully authenticated.
ru_ru: Успешно авторизован.

source: by
ru_ru: от

# song_header_title
source: Title
ru_ru: Название

# song_header_album
source: Album
ru_ru: Альбом

# song_header_artist
source: Artist
ru_ru: Исполнитель

# song_header_length
source: Length
ru_ru: Длина

# song_header_rating
source: Rating
ru_ru: Оценка

# yt_header_name
source: YouTube
ru_ru: Видео

# yt_header_channel
source: Channel
ru_ru: Канал

# album_header_name
source: Album
ru_ru: Альбом

# album_header_artist
source: Artist
ru_ru: Исполнитель

# album_header_year
source: Year
ru_ru: Год

# artist_header_name
source: Artist
ru_ru: Исполнитель

# situation_header_name
source: Situation
ru_ru: Ситуация

# situation_header_desc
source: Description
ru_ru: Описание

# radiostation_header_name
source: Station Name
ru_ru: Название Станции

# playlist_header_name
source: Playlist Name
ru_ru: Название Плейлиста

# playlist_header_song_cnt
source: # Songs
ru_ru: Кол-во Песен

# search_prompt
source: search
ru_ru: поиск

# prev_songs_title
source: Previous Songs
ru_ru: Предыдущие Песни

# status_idle
source: Idle
ru_ru: В простое
